[
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "make_model_tuple",
                "file_name": "django/db/models/utils.py"
            },
            "call_ok": true
        },
        {
            "func_name": "search_class_in_file",
            "arguments": {
                "class_name": "Model",
                "file_name": "django/db/models/base.py"
            },
            "call_ok": true
        },
        {
            "func_name": "search_class_in_file",
            "arguments": {
                "class_name": "Options",
                "file_name": "django/db/models/options.py"
            },
            "call_ok": true
        },
        {
            "func_name": "search_class_in_file",
            "arguments": {
                "class_name": "QuerySet",
                "file_name": "django/db/models/query.py"
            },
            "call_ok": true
        },
        {
            "func_name": "search_class_in_file",
            "arguments": {
                "class_name": "Field",
                "file_name": "django/db/models/fields/__init__.py"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "search_method",
            "arguments": {
                "method_name": "model_to_dict"
            },
            "call_ok": true
        },
        {
            "func_name": "search_code",
            "arguments": {
                "code_str": "if fields and f.name not in fields:"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "search_method_in_file",
            "arguments": {
                "method_name": "model_to_dict",
                "file_name": "django/forms/models.py"
            },
            "call_ok": true
        }
    ],
    [
        {
            "func_name": "write_patch",
            "arguments": {},
            "call_ok": true
        }
    ]
]